Revit 2027 API
Transform1D(Transform1D) Constructor
 The copy constructor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform1D(
	Transform1D other
)
Public Sub New (
	other As Transform1D
)
public:
Transform1D(
	Transform1D^ other
)
new :
        other : Transform1D -> Transform1D
Parameters
other Transform1D
 The transformation to use as input.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Transform1D Class
Transform1D Overload
Autodesk.Revit.DB Namespace